case/demo/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



interpolationScheme cellPoint;
  
  setFormat       raw;
  sets
  (
      Profile_100
      {
          type   uniform; //cloud;
         axis    z; // xyz;
        start (100 5 0);
        end   (100 5 500);
        nPoints  200;
      }

      Profile_500
      {
          type   uniform; //cloud;
         axis    z; // xyz;
        start (500 5 0);
        end   (500 5 500);
        nPoints  200;
      }

      Profile_900
      {
          type   uniform; //cloud;
         axis    z; // xyz;
        start (900 5 0);
        end   (900 5 500);
        nPoints  200;
      }

  );
  
  fields          ( 
                   U
                   k
		   T	
                  ); 
