case/demo/system/setDiscreteFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;

    class           dictionary;
    object          setDiscreteFieldsDict;
}
Fields
(
	keyword1
	{
		field U;        //targetField        		
                type vector;    //type "scalar" or "vector" 
		direction "z";  //direction "x","y", or "z" 
		internal false;  //set internal field or not ,true or false
		patchNames
                (
	                inlet
                );              //patchNames to set value 
                profile
                (
			(0.0 2.5 0.292102 3.89220998952 7.14987747e-16 8.87444069202e-19)
			(0.0 7.5 0.292102 3.89220998952 7.14987747e-16 8.87444069202e-19)
			(0.0 12.5 0.292102 3.89220998952 7.14987747e-16 8.87444069202e-19)
			(0.0 17.5 0.292102 3.89220998952 7.14987747e-16 8.87444069202e-19)
			(0.0 22.5 0.292102 3.89220998952 7.14987747e-16 8.87444069202e-19)
			(0.0 27.5 0.292102 3.89220998952 7.14987747e-16 8.87444069202e-19)
			(0.0 32.5 0.292102 3.89220998952 7.14987747e-16 8.87444069202e-19)
			(0.0 37.5 0.292102 3.89220998952 7.14987747e-16 8.87444069202e-19)
			(0.0 42.5 0.292102 3.89220998952 7.14987747e-16 8.87444069202e-19)
			(0.0 47.5 0.292102 3.89220998952 7.14987747e-16 8.87444069202e-19)
			(0.0 52.5 0.292102 3.89220998952 7.14987747e-16 8.87444069202e-19)
			(0.0 57.5 0.292102 3.89220998952 7.14987747e-16 8.87444069202e-19)
			(0.0 62.5 0.292102 3.89220998952 7.14987747e-16 8.87444069202e-19)
			(0.0 67.5 0.292102 3.89220998952 7.14987747e-16 8.87444069202e-19)
			(0.0 72.5 0.292102 3.89220998952 7.14987747e-16 8.87444069202e-19)
			(0.0 77.5 0.292102 3.89220998952 7.14987747e-16 8.87444069202e-19)
			(0.0 82.5 0.292102 3.89220998952 7.14987747e-16 8.87444069202e-19)
			(0.0 87.5 0.292102 3.89220998952 7.14987747e-16 8.87444069202e-19)
			(0.0 92.5 0.292102 3.89220998952 7.14987747e-16 8.87444069202e-19)
			(0.0 97.5 0.292102 3.89220998952 7.14987747e-16 8.87444069202e-19)
			(0.0 2.5 0.89027 5.04126672219 9.26066134988e-16 1.08443746449e-18)
			(0.0 7.5 0.89027 5.04126672219 9.26066134988e-16 1.08443746449e-18)
			(0.0 12.5 0.89027 5.04126672219 9.26066134988e-16 1.08443746449e-18)
			(0.0 17.5 0.89027 5.04126672219 9.26066134988e-16 1.08443746449e-18)
			(0.0 22.5 0.89027 5.04126672219 9.26066134988e-16 1.08443746449e-18)
			(0.0 27.5 0.89027 5.04126672219 9.26066134988e-16 1.08443746449e-18)
			(0.0 32.5 0.89027 5.04126672219 9.26066134988e-16 1.08443746449e-18)
			(0.0 37.5 0.89027 5.04126672219 9.26066134988e-16 1.08443746449e-18)
			(0.0 42.5 0.89027 5.04126672219 9.26066134988e-16 1.08443746449e-18)
			(0.0 47.5 0.89027 5.04126672219 9.26066134988e-16 1.08443746449e-18)
			(0.0 52.5 0.89027 5.04126672219 9.26066134988e-16 1.08443746449e-18)
			(0.0 57.5 0.89027 5.04126672219 9.26066134988e-16 1.08443746449e-18)
			(0.0 62.5 0.89027 5.04126672219 9.26066134988e-16 1.08443746449e-18)
			(0.0 67.5 0.89027 5.04126672219 9.26066134988e-16 1.08443746449e-18)
			(0.0 72.5 0.89027 5.04126672219 9.26066134988e-16 1.08443746449e-18)
			(0.0 77.5 0.89027 5.04126672219 9.26066134988e-16 1.08443746449e-18)
			(0.0 82.5 0.89027 5.04126672219 9.26066134988e-16 1.08443746449e-18)
			(0.0 87.5 0.89027 5.04126672219 9.26066134988e-16 1.08443746449e-18)
			(0.0 92.5 0.89027 5.04126672219 9.26066134988e-16 1.08443746449e-18)
			(0.0 97.5 0.89027 5.04126672219 9.26066134988e-16 1.08443746449e-18)
			(0.0 2.5 1.51703 5.57500769219 1.0241151138e-15 7.87845956631e-18)
			(0.0 7.5 1.51703 5.57500769219 1.0241151138e-15 7.87845956631e-18)
			(0.0 12.5 1.51703 5.57500769219 1.0241151138e-15 7.87845956631e-18)
			(0.0 17.5 1.51703 5.57500769219 1.0241151138e-15 7.87845956631e-18)
			(0.0 22.5 1.51703 5.57500769219 1.0241151138e-15 7.87845956631e-18)
			(0.0 27.5 1.51703 5.57500769219 1.0241151138e-15 7.87845956631e-18)
			(0.0 32.5 1.51703 5.57500769219 1.0241151138e-15 7.87845956631e-18)
			(0.0 37.5 1.51703 5.57500769219 1.0241151138e-15 7.87845956631e-18)
			(0.0 42.5 1.51703 5.57500769219 1.0241151138e-15 7.87845956631e-18)
			(0.0 47.5 1.51703 5.57500769219 1.0241151138e-15 7.87845956631e-18)
			(0.0 52.5 1.51703 5.57500769219 1.0241151138e-15 7.87845956631e-18)
			(0.0 57.5 1.51703 5.57500769219 1.0241151138e-15 7.87845956631e-18)
			(0.0 62.5 1.51703 5.57500769219 1.0241151138e-15 7.87845956631e-18)
			(0.0 67.5 1.51703 5.57500769219 1.0241151138e-15 7.87845956631e-18)
			(0.0 72.5 1.51703 5.57500769219 1.0241151138e-15 7.87845956631e-18)
			(0.0 77.5 1.51703 5.57500769219 1.0241151138e-15 7.87845956631e-18)
			(0.0 82.5 1.51703 5.57500769219 1.0241151138e-15 7.87845956631e-18)
			(0.0 87.5 1.51703 5.57500769219 1.0241151138e-15 7.87845956631e-18)
			(0.0 92.5 1.51703 5.57500769219 1.0241151138e-15 7.87845956631e-18)
			(0.0 97.5 1.51703 5.57500769219 1.0241151138e-15 7.87845956631e-18)
			(0.0 2.5 2.17375 5.93141095541 1.08958420382e-15 7.04775355303e-18)
			(0.0 7.5 2.17375 5.93141095541 1.08958420382e-15 7.04775355303e-18)
			(0.0 12.5 2.17375 5.93141095541 1.08958420382e-15 7.04775355303e-18)
			(0.0 17.5 2.17375 5.93141095541 1.08958420382e-15 7.04775355303e-18)
			(0.0 22.5 2.17375 5.93141095541 1.08958420382e-15 7.04775355303e-18)
			(0.0 27.5 2.17375 5.93141095541 1.08958420382e-15 7.04775355303e-18)
			(0.0 32.5 2.17375 5.93141095541 1.08958420382e-15 7.04775355303e-18)
			(0.0 37.5 2.17375 5.93141095541 1.08958420382e-15 7.04775355303e-18)
			(0.0 42.5 2.17375 5.93141095541 1.08958420382e-15 7.04775355303e-18)
			(0.0 47.5 2.17375 5.93141095541 1.08958420382e-15 7.04775355303e-18)
			(0.0 52.5 2.17375 5.93141095541 1.08958420382e-15 7.04775355303e-18)
			(0.0 57.5 2.17375 5.93141095541 1.08958420382e-15 7.04775355303e-18)
			(0.0 62.5 2.17375 5.93141095541 1.08958420382e-15 7.04775355303e-18)
			(0.0 67.5 2.17375 5.93141095541 1.08958420382e-15 7.04775355303e-18)
			(0.0 72.5 2.17375 5.93141095541 1.08958420382e-15 7.04775355303e-18)
			(0.0 77.5 2.17375 5.93141095541 1.08958420382e-15 7.04775355303e-18)
			(0.0 82.5 2.17375 5.93141095541 1.08958420382e-15 7.04775355303e-18)
			(0.0 87.5 2.17375 5.93141095541 1.08958420382e-15 7.04775355303e-18)
			(0.0 92.5 2.17375 5.93141095541 1.08958420382e-15 7.04775355303e-18)
			(0.0 97.5 2.17375 5.93141095541 1.08958420382e-15 7.04775355303e-18)
			(0.0 2.5 2.86187 6.20313796354 1.13949638867e-15 9.88746676364e-18)
			(0.0 7.5 2.86187 6.20313796354 1.13949638867e-15 9.88746676364e-18)
			(0.0 12.5 2.86187 6.20313796354 1.13949638867e-15 9.88746676364e-18)
			(0.0 17.5 2.86187 6.20313796354 1.13949638867e-15 9.88746676364e-18)
			(0.0 22.5 2.86187 6.20313796354 1.13949638867e-15 9.88746676364e-18)
			(0.0 27.5 2.86187 6.20313796354 1.13949638867e-15 9.88746676364e-18)
			(0.0 32.5 2.86187 6.20313796354 1.13949638867e-15 9.88746676364e-18)
			(0.0 37.5 2.86187 6.20313796354 1.13949638867e-15 9.88746676364e-18)
			(0.0 42.5 2.86187 6.20313796354 1.13949638867e-15 9.88746676364e-18)
			(0.0 47.5 2.86187 6.20313796354 1.13949638867e-15 9.88746676364e-18)
			(0.0 52.5 2.86187 6.20313796354 1.13949638867e-15 9.88746676364e-18)
			(0.0 57.5 2.86187 6.20313796354 1.13949638867e-15 9.88746676364e-18)
			(0.0 62.5 2.86187 6.20313796354 1.13949638867e-15 9.88746676364e-18)
			(0.0 67.5 2.86187 6.20313796354 1.13949638867e-15 9.88746676364e-18)
			(0.0 72.5 2.86187 6.20313796354 1.13949638867e-15 9.88746676364e-18)
			(0.0 77.5 2.86187 6.20313796354 1.13949638867e-15 9.88746676364e-18)
			(0.0 82.5 2.86187 6.20313796354 1.13949638867e-15 9.88746676364e-18)
			(0.0 87.5 2.86187 6.20313796354 1.13949638867e-15 9.88746676364e-18)
			(0.0 92.5 2.86187 6.20313796354 1.13949638867e-15 9.88746676364e-18)
...
                ); 
	} 
	keyword2
	{
		field k;        //targetField        		
                type scalar;    //type "scalar" or "vector" 
		direction "z";  //direction "x","y", or "z" 
		internal false;  //
		patchNames 
                (
                	inlet
                );              //patchNames to set value 
                profile
                (
			(0.0 2.5 0.292102 0.579504194256)
			(0.0 7.5 0.292102 0.579504194256)
			(0.0 12.5 0.292102 0.579504194256)
			(0.0 17.5 0.292102 0.579504194256)
			(0.0 22.5 0.292102 0.579504194256)
			(0.0 27.5 0.292102 0.579504194256)
			(0.0 32.5 0.292102 0.579504194256)
			(0.0 37.5 0.292102 0.579504194256)
			(0.0 42.5 0.292102 0.579504194256)
			(0.0 47.5 0.292102 0.579504194256)
			(0.0 52.5 0.292102 0.579504194256)
			(0.0 57.5 0.292102 0.579504194256)
			(0.0 62.5 0.292102 0.579504194256)
			(0.0 67.5 0.292102 0.579504194256)
			(0.0 72.5 0.292102 0.579504194256)
			(0.0 77.5 0.292102 0.579504194256)
			(0.0 82.5 0.292102 0.579504194256)
			(0.0 87.5 0.292102 0.579504194256)
			(0.0 92.5 0.292102 0.579504194256)
			(0.0 97.5 0.292102 0.579504194256)
			(0.0 2.5 0.89027 0.559002247263)
			(0.0 7.5 0.89027 0.559002247263)
			(0.0 12.5 0.89027 0.559002247263)
			(0.0 17.5 0.89027 0.559002247263)
			(0.0 22.5 0.89027 0.559002247263)
			(0.0 27.5 0.89027 0.559002247263)
			(0.0 32.5 0.89027 0.559002247263)
			(0.0 37.5 0.89027 0.559002247263)
			(0.0 42.5 0.89027 0.559002247263)
			(0.0 47.5 0.89027 0.559002247263)
			(0.0 52.5 0.89027 0.559002247263)
			(0.0 57.5 0.89027 0.559002247263)
			(0.0 62.5 0.89027 0.559002247263)
			(0.0 67.5 0.89027 0.559002247263)
			(0.0 72.5 0.89027 0.559002247263)
			(0.0 77.5 0.89027 0.559002247263)
			(0.0 82.5 0.89027 0.559002247263)
			(0.0 87.5 0.89027 0.559002247263)
			(0.0 92.5 0.89027 0.559002247263)
			(0.0 97.5 0.89027 0.559002247263)
			(0.0 2.5 1.51703 0.554725201275)
			(0.0 7.5 1.51703 0.554725201275)
			(0.0 12.5 1.51703 0.554725201275)
			(0.0 17.5 1.51703 0.554725201275)
			(0.0 22.5 1.51703 0.554725201275)
			(0.0 27.5 1.51703 0.554725201275)
			(0.0 32.5 1.51703 0.554725201275)
			(0.0 37.5 1.51703 0.554725201275)
			(0.0 42.5 1.51703 0.554725201275)
			(0.0 47.5 1.51703 0.554725201275)
			(0.0 52.5 1.51703 0.554725201275)
			(0.0 57.5 1.51703 0.554725201275)
			(0.0 62.5 1.51703 0.554725201275)
			(0.0 67.5 1.51703 0.554725201275)
			(0.0 72.5 1.51703 0.554725201275)
			(0.0 77.5 1.51703 0.554725201275)
			(0.0 82.5 1.51703 0.554725201275)
			(0.0 87.5 1.51703 0.554725201275)
			(0.0 92.5 1.51703 0.554725201275)
			(0.0 97.5 1.51703 0.554725201275)
			(0.0 2.5 2.17375 0.552429560786)
			(0.0 7.5 2.17375 0.552429560786)
			(0.0 12.5 2.17375 0.552429560786)
			(0.0 17.5 2.17375 0.552429560786)
			(0.0 22.5 2.17375 0.552429560786)
			(0.0 27.5 2.17375 0.552429560786)
			(0.0 32.5 2.17375 0.552429560786)
			(0.0 37.5 2.17375 0.552429560786)
			(0.0 42.5 2.17375 0.552429560786)
			(0.0 47.5 2.17375 0.552429560786)
			(0.0 52.5 2.17375 0.552429560786)
			(0.0 57.5 2.17375 0.552429560786)
			(0.0 62.5 2.17375 0.552429560786)
			(0.0 67.5 2.17375 0.552429560786)
			(0.0 72.5 2.17375 0.552429560786)
			(0.0 77.5 2.17375 0.552429560786)
			(0.0 82.5 2.17375 0.552429560786)
			(0.0 87.5 2.17375 0.552429560786)
			(0.0 92.5 2.17375 0.552429560786)
			(0.0 97.5 2.17375 0.552429560786)
			(0.0 2.5 2.86187 0.550617577256)
			(0.0 7.5 2.86187 0.550617577256)
			(0.0 12.5 2.86187 0.550617577256)
			(0.0 17.5 2.86187 0.550617577256)
			(0.0 22.5 2.86187 0.550617577256)
			(0.0 27.5 2.86187 0.550617577256)
			(0.0 32.5 2.86187 0.550617577256)
			(0.0 37.5 2.86187 0.550617577256)
			(0.0 42.5 2.86187 0.550617577256)
			(0.0 47.5 2.86187 0.550617577256)
			(0.0 52.5 2.86187 0.550617577256)
			(0.0 57.5 2.86187 0.550617577256)
			(0.0 62.5 2.86187 0.550617577256)
			(0.0 67.5 2.86187 0.550617577256)
			(0.0 72.5 2.86187 0.550617577256)
			(0.0 77.5 2.86187 0.550617577256)
			(0.0 82.5 2.86187 0.550617577256)
			(0.0 87.5 2.86187 0.550617577256)
			(0.0 92.5 2.86187 0.550617577256)
...
                ); 
	} 
	keyword3
	{
		field T;        //targetField        		
                type scalar;    //type "scalar" or "vector" 
		direction "z";  //direction "x","y", or "z" 
		internal false;  //
		patchNames 
                (
                	inlet
                );              //patchNames to set value 
                profile
                (
			(0.0 2.5 0.292102 293.0)
			(0.0 7.5 0.292102 293.0)
			(0.0 12.5 0.292102 293.0)
			(0.0 17.5 0.292102 293.0)
			(0.0 22.5 0.292102 293.0)
			(0.0 27.5 0.292102 293.0)
			(0.0 32.5 0.292102 293.0)
			(0.0 37.5 0.292102 293.0)
			(0.0 42.5 0.292102 293.0)
			(0.0 47.5 0.292102 293.0)
			(0.0 52.5 0.292102 293.0)
			(0.0 57.5 0.292102 293.0)
			(0.0 62.5 0.292102 293.0)
			(0.0 67.5 0.292102 293.0)
			(0.0 72.5 0.292102 293.0)
			(0.0 77.5 0.292102 293.0)
			(0.0 82.5 0.292102 293.0)
			(0.0 87.5 0.292102 293.0)
			(0.0 92.5 0.292102 293.0)
			(0.0 97.5 0.292102 293.0)
			(0.0 2.5 0.89027 293.0)
			(0.0 7.5 0.89027 293.0)
			(0.0 12.5 0.89027 293.0)
			(0.0 17.5 0.89027 293.0)
			(0.0 22.5 0.89027 293.0)
			(0.0 27.5 0.89027 293.0)
			(0.0 32.5 0.89027 293.0)
			(0.0 37.5 0.89027 293.0)
			(0.0 42.5 0.89027 293.0)
			(0.0 47.5 0.89027 293.0)
			(0.0 52.5 0.89027 293.0)
			(0.0 57.5 0.89027 293.0)
			(0.0 62.5 0.89027 293.0)
			(0.0 67.5 0.89027 293.0)
			(0.0 72.5 0.89027 293.0)
			(0.0 77.5 0.89027 293.0)
			(0.0 82.5 0.89027 293.0)
			(0.0 87.5 0.89027 293.0)
			(0.0 92.5 0.89027 293.0)
			(0.0 97.5 0.89027 293.0)
			(0.0 2.5 1.51703 293.0)
			(0.0 7.5 1.51703 293.0)
			(0.0 12.5 1.51703 293.0)
			(0.0 17.5 1.51703 293.0)
			(0.0 22.5 1.51703 293.0)
			(0.0 27.5 1.51703 293.0)
			(0.0 32.5 1.51703 293.0)
			(0.0 37.5 1.51703 293.0)
			(0.0 42.5 1.51703 293.0)
			(0.0 47.5 1.51703 293.0)
			(0.0 52.5 1.51703 293.0)
			(0.0 57.5 1.51703 293.0)
			(0.0 62.5 1.51703 293.0)
			(0.0 67.5 1.51703 293.0)
			(0.0 72.5 1.51703 293.0)
			(0.0 77.5 1.51703 293.0)
			(0.0 82.5 1.51703 293.0)
			(0.0 87.5 1.51703 293.0)
			(0.0 92.5 1.51703 293.0)
			(0.0 97.5 1.51703 293.0)
			(0.0 2.5 2.17375 293.0)
			(0.0 7.5 2.17375 293.0)
			(0.0 12.5 2.17375 293.0)
			(0.0 17.5 2.17375 293.0)
			(0.0 22.5 2.17375 293.0)
			(0.0 27.5 2.17375 293.0)
			(0.0 32.5 2.17375 293.0)
			(0.0 37.5 2.17375 293.0)
			(0.0 42.5 2.17375 293.0)
			(0.0 47.5 2.17375 293.0)
			(0.0 52.5 2.17375 293.0)
			(0.0 57.5 2.17375 293.0)
			(0.0 62.5 2.17375 293.0)
			(0.0 67.5 2.17375 293.0)
			(0.0 72.5 2.17375 293.0)
			(0.0 77.5 2.17375 293.0)
			(0.0 82.5 2.17375 293.0)
			(0.0 87.5 2.17375 293.0)
			(0.0 92.5 2.17375 293.0)
			(0.0 97.5 2.17375 293.0)
			(0.0 2.5 2.86187 293.0)
			(0.0 7.5 2.86187 293.0)
			(0.0 12.5 2.86187 293.0)
			(0.0 17.5 2.86187 293.0)
			(0.0 22.5 2.86187 293.0)
			(0.0 27.5 2.86187 293.0)
			(0.0 32.5 2.86187 293.0)
			(0.0 37.5 2.86187 293.0)
			(0.0 42.5 2.86187 293.0)
			(0.0 47.5 2.86187 293.0)
			(0.0 52.5 2.86187 293.0)
			(0.0 57.5 2.86187 293.0)
			(0.0 62.5 2.86187 293.0)
			(0.0 67.5 2.86187 293.0)
			(0.0 72.5 2.86187 293.0)
			(0.0 77.5 2.86187 293.0)
			(0.0 82.5 2.86187 293.0)
			(0.0 87.5 2.86187 293.0)
			(0.0 92.5 2.86187 293.0)
...
                ); 
	} 
	keyword4
	{
		field epsilon;        //targetField        		
                type scalar;    //type "scalar" or "vector" 
		direction "z";  //direction "x","y", or "z" 
		internal false;  //
		patchNames 
                (
                	inlet
                );              //patchNames to set value 
                profile
                (
			(0.0 2.5 0.292102 0.660368923175)
			(0.0 7.5 0.292102 0.660368923175)
			(0.0 12.5 0.292102 0.660368923175)
			(0.0 17.5 0.292102 0.660368923175)
			(0.0 22.5 0.292102 0.660368923175)
			(0.0 27.5 0.292102 0.660368923175)
			(0.0 32.5 0.292102 0.660368923175)
			(0.0 37.5 0.292102 0.660368923175)
			(0.0 42.5 0.292102 0.660368923175)
			(0.0 47.5 0.292102 0.660368923175)
			(0.0 52.5 0.292102 0.660368923175)
			(0.0 57.5 0.292102 0.660368923175)
			(0.0 62.5 0.292102 0.660368923175)
			(0.0 67.5 0.292102 0.660368923175)
			(0.0 72.5 0.292102 0.660368923175)
			(0.0 77.5 0.292102 0.660368923175)
			(0.0 82.5 0.292102 0.660368923175)
			(0.0 87.5 0.292102 0.660368923175)
			(0.0 92.5 0.292102 0.660368923175)
			(0.0 97.5 0.292102 0.660368923175)
			(0.0 2.5 0.89027 0.192948280901)
			(0.0 7.5 0.89027 0.192948280901)
			(0.0 12.5 0.89027 0.192948280901)
			(0.0 17.5 0.89027 0.192948280901)
			(0.0 22.5 0.89027 0.192948280901)
			(0.0 27.5 0.89027 0.192948280901)
			(0.0 32.5 0.89027 0.192948280901)
			(0.0 37.5 0.89027 0.192948280901)
			(0.0 42.5 0.89027 0.192948280901)
			(0.0 47.5 0.89027 0.192948280901)
			(0.0 52.5 0.89027 0.192948280901)
			(0.0 57.5 0.89027 0.192948280901)
			(0.0 62.5 0.89027 0.192948280901)
			(0.0 67.5 0.89027 0.192948280901)
			(0.0 72.5 0.89027 0.192948280901)
			(0.0 77.5 0.89027 0.192948280901)
			(0.0 82.5 0.89027 0.192948280901)
			(0.0 87.5 0.89027 0.192948280901)
			(0.0 92.5 0.89027 0.192948280901)
			(0.0 97.5 0.89027 0.192948280901)
			(0.0 2.5 1.51703 0.109555729113)
			(0.0 7.5 1.51703 0.109555729113)
			(0.0 12.5 1.51703 0.109555729113)
			(0.0 17.5 1.51703 0.109555729113)
			(0.0 22.5 1.51703 0.109555729113)
			(0.0 27.5 1.51703 0.109555729113)
			(0.0 32.5 1.51703 0.109555729113)
			(0.0 37.5 1.51703 0.109555729113)
			(0.0 42.5 1.51703 0.109555729113)
			(0.0 47.5 1.51703 0.109555729113)
			(0.0 52.5 1.51703 0.109555729113)
			(0.0 57.5 1.51703 0.109555729113)
			(0.0 62.5 1.51703 0.109555729113)
			(0.0 67.5 1.51703 0.109555729113)
			(0.0 72.5 1.51703 0.109555729113)
			(0.0 77.5 1.51703 0.109555729113)
			(0.0 82.5 1.51703 0.109555729113)
			(0.0 87.5 1.51703 0.109555729113)
			(0.0 92.5 1.51703 0.109555729113)
			(0.0 97.5 1.51703 0.109555729113)
			(0.0 2.5 2.17375 0.0753473550817)
			(0.0 7.5 2.17375 0.0753473550817)
			(0.0 12.5 2.17375 0.0753473550817)
			(0.0 17.5 2.17375 0.0753473550817)
			(0.0 22.5 2.17375 0.0753473550817)
			(0.0 27.5 2.17375 0.0753473550817)
			(0.0 32.5 2.17375 0.0753473550817)
			(0.0 37.5 2.17375 0.0753473550817)
			(0.0 42.5 2.17375 0.0753473550817)
			(0.0 47.5 2.17375 0.0753473550817)
			(0.0 52.5 2.17375 0.0753473550817)
			(0.0 57.5 2.17375 0.0753473550817)
			(0.0 62.5 2.17375 0.0753473550817)
			(0.0 67.5 2.17375 0.0753473550817)
			(0.0 72.5 2.17375 0.0753473550817)
			(0.0 77.5 2.17375 0.0753473550817)
			(0.0 82.5 2.17375 0.0753473550817)
			(0.0 87.5 2.17375 0.0753473550817)
			(0.0 92.5 2.17375 0.0753473550817)
			(0.0 97.5 2.17375 0.0753473550817)
			(0.0 2.5 2.86187 0.0567601653478)
			(0.0 7.5 2.86187 0.0567601653478)
			(0.0 12.5 2.86187 0.0567601653478)
			(0.0 17.5 2.86187 0.0567601653478)
			(0.0 22.5 2.86187 0.0567601653478)
			(0.0 27.5 2.86187 0.0567601653478)
			(0.0 32.5 2.86187 0.0567601653478)
			(0.0 37.5 2.86187 0.0567601653478)
			(0.0 42.5 2.86187 0.0567601653478)
			(0.0 47.5 2.86187 0.0567601653478)
			(0.0 52.5 2.86187 0.0567601653478)
			(0.0 57.5 2.86187 0.0567601653478)
			(0.0 62.5 2.86187 0.0567601653478)
			(0.0 67.5 2.86187 0.0567601653478)
			(0.0 72.5 2.86187 0.0567601653478)
			(0.0 77.5 2.86187 0.0567601653478)
			(0.0 82.5 2.86187 0.0567601653478)
			(0.0 87.5 2.86187 0.0567601653478)
			(0.0 92.5 2.86187 0.0567601653478)
...
                ); 
	} 
); 
